{
  "backend/main.mo": "Minimal Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature report mapping project requirements to affected files and components.",
  "frontend-file-summaries.txt": "Text file listing high-level summaries for all frontend components and pages.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables for light/dark themes.",
  "frontend/index.html": "HTML entry point with meta tags, fonts, and root mount element.",
  "frontend/src/App.tsx": "React app router defining routes for all five pages using a shared layout.",
  "frontend/src/components/branding/Section.tsx": "Reusable Section and SectionHeader components for consistent page structure.",
  "frontend/src/components/layout/Footer.tsx": "Footer with salon details, contact info, booking link, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation, branding, and call button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps header, footer, and routed page content.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to user identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login and state.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for potential data queries; contains no logic.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables for a warm luxury palette used across the app.",
  "frontend/src/main.tsx": "Initializes React root, wraps the app with React Query and Internet Identity providers, and imports global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with salon details, location, expertise highlights, and commitment sections.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information, hours, booking links, and full address with styled sections.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery of salon images with a selectable lightbox modal for enlarged viewing.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero banner, booking actions, and highlighted service categories.",
  "frontend/src/pages/ServicesPage.tsx": "Lists detailed hair, skin, and nail services with featured sections and styled service categories.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system using CSS variables, extended fonts, shadows, and animations, plus plugin integration.",
  "project_state.json": "Defines project state, features, and image requirements for building a 5‑page luxury salon website."
}